app/Models/caudalModelo.php

INSERT INTO `caudal` (`Caudal`, `IdNodemcu`) VALUES ('0', 'DE32A7B02A8C')
---
    public function insertarCaudal($datos)
    {
        $registrar = $this->db->table('caudal');
        $registrar->insert($datos);